In [84]:
import pandas as pd

d = {"USN":[100,101,102],
     "Name":[None, "tom", "ramesh"],
     "Mobile":[99,88,77],
     "marks":[30,35,None],
    }

In [82]:
std = pd.DataFrame(d)

In [83]:
std.head()

   USN    Name  Mobile  marks
0  100    None      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [11]:
std.head(2)

   USN   Name  Mobile  marks
0  100  jerry      99     30
1  101    tom      88     35

In [12]:
std.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   USN     3 non-null      int64
 1   Name    3 non-null      object
 2   Mobile  3 non-null      int64
 3   marks   3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

In [14]:
std.isnull()

     USN   Name  Mobile  marks
0  False  False   False  False
1  False  False   False  False
2  False  False   False  False

In [7]:
#accessing columns
std["USN"]
#multiple columns
std[["USN", "marks"]]

   USN  marks
0  100   30.0
1  101   35.0
2  102    NaN

In [21]:
#getting the rows 
std.loc[1]

USN       101
Name      tom
Mobile     88
marks      35
Name: 1, dtype: object

In [76]:
#question
cars = {"car_id":[100,101,102,103,104,105],
        "car_name":["ecosport", "jaguar", "supra","Polo GT", "Audi Q5",None],
        
}

In [77]:
df = pd.DataFrame(cars)

In [78]:
df

   car_id  car_name
0     100  ecosport
1     101    jaguar
2     102     supra
3     103   Polo GT
4     104   Audi Q5
5     105      None

In [58]:
df.head(3)

   car_id  car_name
0     100  ecosport
1     101    jaguar
2     102     supra

In [80]:
df.loc[3]

car_id          103
car_name    Polo GT
Name: 3, dtype: object

In [65]:
df.isnull()

   car_id  car_name
0   False     False
1   False     False
2   False     False
3   False     False
4   False     False
5   False      True

In [68]:
df.iloc[4]

car_id          104
car_name    Audi Q5
Name: 4, dtype: object

In [90]:
#setting a new index
index = ["A","B","C"]
std.set_index("USN")

# # #or 
# D = std.DataFrame(d, index = ["A","B","C"])

std

   USN    Name  Mobile  marks
0  100    None      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [76]:
#conditional selection
std["marks"]<35

0     True
1    False
2     True
Name: marks, dtype: bool

In [23]:
#if you want the values
std.loc[std["marks"]<35]

#or

   USN  Name  Mobile  marks
0  100  None      99   30.0

In [24]:
newdf = std["marks"]<35
std[newdf][["Name","Mobile","USN"]]

   Name  Mobile  USN
0  None      99  100

In [41]:
#multiple conditions
std[(std["Name"] == "jerry")&(std["marks"]>20)]

   USN   Name  Mobile  marks
0  100  jerry      99   30.0

In [43]:
std[(std["USN"]>100)|(std["marks"]<40)]

   USN    Name  Mobile  marks
0  100   jerry      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [47]:
#adding new column
s = "banglore,delhi,kashmir".split(",")
print(s,type)
std["Address"] = s
std

['banglore', 'delhi', 'kashmir'] <class 'type'>

   USN    Name  Mobile  marks   Address
0  100   jerry      99   30.0  banglore
1  101     tom      88   35.0     delhi
2  102  ramesh      77    NaN   kashmir

In [54]:
#delete column
std.drop("Address",axis = 1,inplace = True)#inplace = true makes the column dissapear permanently

In [55]:
std

   USN    Name  Mobile  marks
0  100   jerry      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [72]:
#handling missing values
std.dropna(thresh =3)

   USN    Name  Mobile  marks
0  100    None      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [105]:
#adding missing values
std["marks"].fillna("not confirmed", inplace = False)
std["marks"].fillna(method = "ffill")

0             30.0
1             35.0
2    not confirmed
Name: marks, dtype: object